MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024EFE064/mcu.h
extern volatile __IPC38bits_t IPC38bits __asm__ ("IPC38") __attribute__((section("sfrs"), address(0xBF8103A0)));
extern volatile uint32_t        IPC38CLR __attribute__((section("sfrs"),address(0xBF8103A4)));
extern volatile uint32_t        IPC38SET __attribute__((section("sfrs"),address(0xBF8103A8)));
extern volatile uint32_t        IPC38INV __attribute__((section("sfrs"),address(0xBF8103AC)));
#define IPC39 IPC39
extern volatile uint32_t   IPC39 __attribute__((section("sfrs"), address(0xBF8103B0)));
typedef union {
  struct {
    uint32_t SPI3TXIS:2;
    uint32_t SPI3TXIP:3;
    uint32_t :3;
    uint32_t U3EIS:2;
    uint32_t U3EIP:3;
    uint32_t :3;
    uint32_t U3RXIS:2;
    uint32_t U3RXIP:3;
    uint32_t :3;
    uint32_t U3TXIS:2;
    uint32_t U3TXIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC39bits_t;
extern volatile __IPC39bits_t IPC39bits __asm__ ("IPC39") __attribute__((section("sfrs"), address(0xBF8103B0)));
extern volatile uint32_t        IPC39CLR __attribute__((section("sfrs"),address(0xBF8103B4)));
extern volatile uint32_t        IPC39SET __attribute__((section("sfrs"),address(0xBF8103B8)));
extern volatile uint32_t        IPC39INV __attribute__((section("sfrs"),address(0xBF8103BC)));
#define IPC40 IPC40
extern volatile uint32_t   IPC40 __attribute__((section("sfrs"), address(0xBF8103C0)));
typedef union {
  struct {
    uint32_t I2C3BIS:2;
    uint32_t I2C3BIP:3;
    uint32_t :3;
    uint32_t I2C3SIS:2;
    uint32_t I2C3SIP:3;
    uint32_t :3;
    uint32_t I2C3MIS:2;
    uint32_t I2C3MIP:3;
    uint32_t :3;
    uint32_t SPI4EIS:2;
    uint32_t SPI4EIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC40bits_t;
extern volatile __IPC40bits_t IPC40bits __asm__ ("IPC40") __attribute__((section("sfrs"), address(0xBF8103C0)));
extern volatile uint32_t        IPC40CLR __attribute__((section("sfrs"),address(0xBF8103C4)));
extern volatile uint32_t        IPC40SET __attribute__((section("sfrs"),address(0xBF8103C8)));
extern volatile uint32_t        IPC40INV __attribute__((section("sfrs"),address(0xBF8103CC)));
#define IPC41 IPC41
extern volatile uint32_t   IPC41 __attribute__((section("sfrs"), address(0xBF8103D0)));
typedef union {
  struct {
    uint32_t SPI4RXIS:2;
    uint32_t SPI4RXIP:3;
    uint32_t :3;
    uint32_t SPI4TXIS:2;
    uint32_t SPI4TXIP:3;
    uint32_t :3;
    uint32_t RTCCIS:2;
    uint32_t RTCCIP:3;
    uint32_t :3;
    uint32_t FCEIS:2;
    uint32_t FCEIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC41bits_t;
extern volatile __IPC41bits_t IPC41bits __asm__ ("IPC41") __attribute__((section("sfrs"), address(0xBF8103D0)));
extern volatile uint32_t        IPC41CLR __attribute__((section("sfrs"),address(0xBF8103D4)));
extern volatile uint32_t        IPC41SET __attribute__((section("sfrs"),address(0xBF8103D8)));
extern volatile uint32_t        IPC41INV __attribute__((section("sfrs"),address(0xBF8103DC)));
#define IPC42 IPC42
extern volatile uint32_t   IPC42 __attribute__((section("sfrs"), address(0xBF8103E0)));
typedef union {
  struct {
    uint32_t PREIS:2;
    uint32_t PREIP:3;
    uint32_t :3;
    uint32_t SQI1IS:2;
    uint32_t SQI1IP:3;
    uint32_t :3;
    uint32_t U4EIS:2;
    uint32_t U4EIP:3;
    uint32_t :3;
    uint32_t U4RXIS:2;
    uint32_t U4RXIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC42bits_t;
extern volatile __IPC42bits_t IPC42bits __asm__ ("IPC42") __attribute__((section("sfrs"), address(0xBF8103E0)));
extern volatile uint32_t        IPC42CLR __attribute__((section("sfrs"),address(0xBF8103E4)));
extern volatile uint32_t        IPC42SET __attribute__((section("sfrs"),address(0xBF8103E8)));
extern volatile uint32_t        IPC42INV __attribute__((section("sfrs"),address(0xBF8103EC)));
#define IPC43 IPC43
extern volatile uint32_t   IPC43 __attribute__((section("sfrs"), address(0xBF8103F0)));
typedef union {
  struct {
    uint32_t U4TXIS:2;
    uint32_t U4TXIP:3;
    uint32_t :3;
    uint32_t I2C4BIS:2;
    uint32_t I2C4BIP:3;
    uint32_t :3;
    uint32_t I2C4SIS:2;
    uint32_t I2C4SIP:3;
    uint32_t :3;
    uint32_t I2C4MIS:2;
    uint32_t I2C4MIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC43bits_t;
extern volatile __IPC43bits_t IPC43bits __asm__ ("IPC43") __attribute__((section("sfrs"), address(0xBF8103F0)));
extern volatile uint32_t        IPC43CLR __attribute__((section("sfrs"),address(0xBF8103F4)));
extern volatile uint32_t        IPC43SET __attribute__((section("sfrs"),address(0xBF8103F8)));
extern volatile uint32_t        IPC43INV __attribute__((section("sfrs"),address(0xBF8103FC)));
#define IPC44 IPC44
extern volatile uint32_t   IPC44 __attribute__((section("sfrs"), address(0xBF810400)));
typedef union {
  struct {
    uint32_t :24;
    uint32_t U5EIS:2;
    uint32_t U5EIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC44bits_t;
extern volatile __IPC44bits_t IPC44bits __asm__ ("IPC44") __attribute__((section("sfrs"), address(0xBF810400)));
extern volatile uint32_t        IPC44CLR __attribute__((section("sfrs"),address(0xBF810404)));
extern volatile uint32_t        IPC44SET __attribute__((section("sfrs"),address(0xBF810408)));
extern volatile uint32_t        IPC44INV __attribute__((section("sfrs"),address(0xBF81040C)));
#define IPC45 IPC45
extern volatile uint32_t   IPC45 __attribute__((section("sfrs"), address(0xBF810410)));
typedef union {
  struct {
    uint32_t U5RXIS:2;
    uint32_t U5RXIP:3;
    uint32_t :3;
    uint32_t U5TXIS:2;
    uint32_t U5TXIP:3;
    uint32_t :3;
    uint32_t I2C5BIS:2;
    uint32_t I2C5BIP:3;
    uint32_t :3;
    uint32_t I2C5SIS:2;
    uint32_t I2C5SIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC45bits_t;
extern volatile __IPC45bits_t IPC45bits __asm__ ("IPC45") __attribute__((section("sfrs"), address(0xBF810410)));
extern volatile uint32_t        IPC45CLR __attribute__((section("sfrs"),address(0xBF810414)));
extern volatile uint32_t        IPC45SET __attribute__((section("sfrs"),address(0xBF810418)));
extern volatile uint32_t        IPC45INV __attribute__((section("sfrs"),address(0xBF81041C)));
#define IPC46 IPC46
extern volatile uint32_t   IPC46 __attribute__((section("sfrs"), address(0xBF810420)));
typedef union {
  struct {
    uint32_t I2C5MIS:2;
    uint32_t I2C5MIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC46bits_t;
