MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024EFE064/mcu.h
extern volatile __DCH0CPTRbits_t DCH0CPTRbits __asm__ ("DCH0CPTR") __attribute__((section("sfrs"), address(0xBF811100)));
#define DCS0CPTR DCS0CPTR
extern volatile uint32_t   DCS0CPTR __attribute__((section("sfrs"), address(0xBF811100)));
typedef struct {
  uint32_t CHCPTR:16;
} __DCS0CPTRbits_t;
extern volatile __DCS0CPTRbits_t DCS0CPTRbits __asm__ ("DCS0CPTR") __attribute__((section("sfrs"), address(0xBF811100)));
extern volatile uint32_t        DCH0CPTRCLR __attribute__((section("sfrs"),address(0xBF811104)));
extern volatile uint32_t        DCS0CPTRCLR __attribute__((section("sfrs"),address(0xBF811104)));
extern volatile uint32_t        DCH0CPTRSET __attribute__((section("sfrs"),address(0xBF811108)));
extern volatile uint32_t        DCS0CPTRSET __attribute__((section("sfrs"),address(0xBF811108)));
extern volatile uint32_t        DCH0CPTRINV __attribute__((section("sfrs"),address(0xBF81110C)));
extern volatile uint32_t        DCS0CPTRINV __attribute__((section("sfrs"),address(0xBF81110C)));
#define DCH0DAT DCH0DAT
extern volatile uint32_t   DCH0DAT __attribute__((section("sfrs"), address(0xBF811110)));
typedef struct {
  uint32_t CHPDAT:16;
} __DCH0DATbits_t;
extern volatile __DCH0DATbits_t DCH0DATbits __asm__ ("DCH0DAT") __attribute__((section("sfrs"), address(0xBF811110)));
extern volatile uint32_t        DCH0DATCLR __attribute__((section("sfrs"),address(0xBF811114)));
extern volatile uint32_t        DCH0DATSET __attribute__((section("sfrs"),address(0xBF811118)));
extern volatile uint32_t        DCH0DATINV __attribute__((section("sfrs"),address(0xBF81111C)));
#define DCH1CON DCH1CON
extern volatile uint32_t   DCH1CON __attribute__((section("sfrs"), address(0xBF811120)));
typedef struct {
  uint32_t CHPRI:2;
  uint32_t CHEDET:1;
  uint32_t :1;
  uint32_t CHAEN:1;
  uint32_t CHCHN:1;
  uint32_t CHAED:1;
  uint32_t CHEN:1;
  uint32_t CHCHNS:1;
  uint32_t :2;
  uint32_t CHPATLEN:1;
  uint32_t :1;
  uint32_t CHPIGNEN:1;
  uint32_t :1;
  uint32_t CHBUSY:1;
  uint32_t :8;
  uint32_t CHPIGN:8;
} __DCH1CONbits_t;
extern volatile __DCH1CONbits_t DCH1CONbits __asm__ ("DCH1CON") __attribute__((section("sfrs"), address(0xBF811120)));
extern volatile uint32_t        DCH1CONCLR __attribute__((section("sfrs"),address(0xBF811124)));
extern volatile uint32_t        DCH1CONSET __attribute__((section("sfrs"),address(0xBF811128)));
extern volatile uint32_t        DCH1CONINV __attribute__((section("sfrs"),address(0xBF81112C)));
#define DCH1ECON DCH1ECON
extern volatile uint32_t   DCH1ECON __attribute__((section("sfrs"), address(0xBF811130)));
typedef struct {
  uint32_t :3;
  uint32_t AIRQEN:1;
  uint32_t SIRQEN:1;
  uint32_t PATEN:1;
  uint32_t CABORT:1;
  uint32_t CFORCE:1;
  uint32_t CHSIRQ:8;
  uint32_t CHAIRQ:8;
} __DCH1ECONbits_t;
extern volatile __DCH1ECONbits_t DCH1ECONbits __asm__ ("DCH1ECON") __attribute__((section("sfrs"), address(0xBF811130)));
extern volatile uint32_t        DCH1ECONCLR __attribute__((section("sfrs"),address(0xBF811134)));
extern volatile uint32_t        DCH1ECONSET __attribute__((section("sfrs"),address(0xBF811138)));
extern volatile uint32_t        DCH1ECONINV __attribute__((section("sfrs"),address(0xBF81113C)));
#define DCH1INT DCH1INT
extern volatile uint32_t   DCH1INT __attribute__((section("sfrs"), address(0xBF811140)));
typedef struct {
  uint32_t CHERIF:1;
  uint32_t CHTAIF:1;
  uint32_t CHCCIF:1;
  uint32_t CHBCIF:1;
  uint32_t CHDHIF:1;
  uint32_t CHDDIF:1;
  uint32_t CHSHIF:1;
  uint32_t CHSDIF:1;
  uint32_t :8;
  uint32_t CHERIE:1;
  uint32_t CHTAIE:1;
  uint32_t CHCCIE:1;
  uint32_t CHBCIE:1;
  uint32_t CHDHIE:1;
  uint32_t CHDDIE:1;
  uint32_t CHSHIE:1;
  uint32_t CHSDIE:1;
} __DCH1INTbits_t;
extern volatile __DCH1INTbits_t DCH1INTbits __asm__ ("DCH1INT") __attribute__((section("sfrs"), address(0xBF811140)));
extern volatile uint32_t        DCH1INTCLR __attribute__((section("sfrs"),address(0xBF811144)));
extern volatile uint32_t        DCH1INTSET __attribute__((section("sfrs"),address(0xBF811148)));
extern volatile uint32_t        DCH1INTINV __attribute__((section("sfrs"),address(0xBF81114C)));
#define DCH1SSA DCH1SSA
extern volatile uint32_t   DCH1SSA __attribute__((section("sfrs"), address(0xBF811150)));
typedef struct {
  uint32_t CHSSA:32;
} __DCH1SSAbits_t;
extern volatile __DCH1SSAbits_t DCH1SSAbits __asm__ ("DCH1SSA") __attribute__((section("sfrs"), address(0xBF811150)));
extern volatile uint32_t        DCH1SSACLR __attribute__((section("sfrs"),address(0xBF811154)));
extern volatile uint32_t        DCH1SSASET __attribute__((section("sfrs"),address(0xBF811158)));
extern volatile uint32_t        DCH1SSAINV __attribute__((section("sfrs"),address(0xBF81115C)));
#define DCH1DSA DCH1DSA
extern volatile uint32_t   DCH1DSA __attribute__((section("sfrs"), address(0xBF811160)));
typedef struct {
  uint32_t CHDSA:32;
} __DCH1DSAbits_t;
extern volatile __DCH1DSAbits_t DCH1DSAbits __asm__ ("DCH1DSA") __attribute__((section("sfrs"), address(0xBF811160)));
extern volatile uint32_t        DCH1DSACLR __attribute__((section("sfrs"),address(0xBF811164)));
extern volatile uint32_t        DCH1DSASET __attribute__((section("sfrs"),address(0xBF811168)));
extern volatile uint32_t        DCH1DSAINV __attribute__((section("sfrs"),address(0xBF81116C)));
#define DCH1SSIZ DCH1SSIZ
extern volatile uint32_t   DCH1SSIZ __attribute__((section("sfrs"), address(0xBF811170)));
typedef struct {
  uint32_t CHSSIZ:16;
} __DCH1SSIZbits_t;
extern volatile __DCH1SSIZbits_t DCH1SSIZbits __asm__ ("DCH1SSIZ") __attribute__((section("sfrs"), address(0xBF811170)));
extern volatile uint32_t        DCH1SSIZCLR __attribute__((section("sfrs"),address(0xBF811174)));
extern volatile uint32_t        DCH1SSIZSET __attribute__((section("sfrs"),address(0xBF811178)));
extern volatile uint32_t        DCH1SSIZINV __attribute__((section("sfrs"),address(0xBF81117C)));
#define DCH1DSIZ DCH1DSIZ
extern volatile uint32_t   DCH1DSIZ __attribute__((section("sfrs"), address(0xBF811180)));
typedef struct {
  uint32_t CHDSIZ:16;
} __DCH1DSIZbits_t;
extern volatile __DCH1DSIZbits_t DCH1DSIZbits __asm__ ("DCH1DSIZ") __attribute__((section("sfrs"), address(0xBF811180)));
extern volatile uint32_t        DCH1DSIZCLR __attribute__((section("sfrs"),address(0xBF811184)));
extern volatile uint32_t        DCH1DSIZSET __attribute__((section("sfrs"),address(0xBF811188)));
extern volatile uint32_t        DCH1DSIZINV __attribute__((section("sfrs"),address(0xBF81118C)));
#define DCH1SPTR DCH1SPTR
extern volatile uint32_t   DCH1SPTR __attribute__((section("sfrs"), address(0xBF811190)));
typedef struct {
  uint32_t CHSPTR:16;
} __DCH1SPTRbits_t;
extern volatile __DCH1SPTRbits_t DCH1SPTRbits __asm__ ("DCH1SPTR") __attribute__((section("sfrs"), address(0xBF811190)));
extern volatile uint32_t        DCH1SPTRCLR __attribute__((section("sfrs"),address(0xBF811194)));
extern volatile uint32_t        DCH1SPTRSET __attribute__((section("sfrs"),address(0xBF811198)));
extern volatile uint32_t        DCH1SPTRINV __attribute__((section("sfrs"),address(0xBF81119C)));
#define DCH1DPTR DCH1DPTR
extern volatile uint32_t   DCH1DPTR __attribute__((section("sfrs"), address(0xBF8111A0)));
typedef struct {
  uint32_t CHDPTR:16;
} __DCH1DPTRbits_t;
extern volatile __DCH1DPTRbits_t DCH1DPTRbits __asm__ ("DCH1DPTR") __attribute__((section("sfrs"), address(0xBF8111A0)));
extern volatile uint32_t        DCH1DPTRCLR __attribute__((section("sfrs"),address(0xBF8111A4)));
extern volatile uint32_t        DCH1DPTRSET __attribute__((section("sfrs"),address(0xBF8111A8)));
extern volatile uint32_t        DCH1DPTRINV __attribute__((section("sfrs"),address(0xBF8111AC)));
#define DCH1CSIZ DCH1CSIZ
extern volatile uint32_t   DCH1CSIZ __attribute__((section("sfrs"), address(0xBF8111B0)));
typedef struct {
  uint32_t CHCSIZ:16;
} __DCH1CSIZbits_t;
extern volatile __DCH1CSIZbits_t DCH1CSIZbits __asm__ ("DCH1CSIZ") __attribute__((section("sfrs"), address(0xBF8111B0)));
extern volatile uint32_t        DCH1CSIZCLR __attribute__((section("sfrs"),address(0xBF8111B4)));
extern volatile uint32_t        DCH1CSIZSET __attribute__((section("sfrs"),address(0xBF8111B8)));
extern volatile uint32_t        DCH1CSIZINV __attribute__((section("sfrs"),address(0xBF8111BC)));
#define DCH1CPTR DCH1CPTR
extern volatile uint32_t   DCH1CPTR __attribute__((section("sfrs"), address(0xBF8111C0)));
typedef struct {
  uint32_t CHCPTR:16;
} __DCH1CPTRbits_t;
extern volatile __DCH1CPTRbits_t DCH1CPTRbits __asm__ ("DCH1CPTR") __attribute__((section("sfrs"), address(0xBF8111C0)));
#define DCS1CPTR DCS1CPTR
extern volatile uint32_t   DCS1CPTR __attribute__((section("sfrs"), address(0xBF8111C0)));
typedef struct {
  uint32_t CHCPTR:16;
} __DCS1CPTRbits_t;
extern volatile __DCS1CPTRbits_t DCS1CPTRbits __asm__ ("DCS1CPTR") __attribute__((section("sfrs"), address(0xBF8111C0)));
extern volatile uint32_t        DCH1CPTRCLR __attribute__((section("sfrs"),address(0xBF8111C4)));
extern volatile uint32_t        DCS1CPTRCLR __attribute__((section("sfrs"),address(0xBF8111C4)));
extern volatile uint32_t        DCH1CPTRSET __attribute__((section("sfrs"),address(0xBF8111C8)));
extern volatile uint32_t        DCS1CPTRSET __attribute__((section("sfrs"),address(0xBF8111C8)));
extern volatile uint32_t        DCH1CPTRINV __attribute__((section("sfrs"),address(0xBF8111CC)));
extern volatile uint32_t        DCS1CPTRINV __attribute__((section("sfrs"),address(0xBF8111CC)));
#define DCH1DAT DCH1DAT
extern volatile uint32_t   DCH1DAT __attribute__((section("sfrs"), address(0xBF8111D0)));
typedef struct {
  uint32_t CHPDAT:16;
} __DCH1DATbits_t;
extern volatile __DCH1DATbits_t DCH1DATbits __asm__ ("DCH1DAT") __attribute__((section("sfrs"), address(0xBF8111D0)));
extern volatile uint32_t        DCH1DATCLR __attribute__((section("sfrs"),address(0xBF8111D4)));
extern volatile uint32_t        DCH1DATSET __attribute__((section("sfrs"),address(0xBF8111D8)));
extern volatile uint32_t        DCH1DATINV __attribute__((section("sfrs"),address(0xBF8111DC)));
#define DCH2CON DCH2CON
extern volatile uint32_t   DCH2CON __attribute__((section("sfrs"), address(0xBF8111E0)));
typedef struct {
  uint32_t CHPRI:2;
  uint32_t CHEDET:1;
  uint32_t :1;
  uint32_t CHAEN:1;
  uint32_t CHCHN:1;
  uint32_t CHAED:1;
  uint32_t CHEN:1;
  uint32_t CHCHNS:1;
  uint32_t :2;
  uint32_t CHPATLEN:1;
  uint32_t :1;
  uint32_t CHPIGNEN:1;
  uint32_t :1;
  uint32_t CHBUSY:1;
  uint32_t :8;
  uint32_t CHPIGN:8;
} __DCH2CONbits_t;
